
export const faceUtils = {
  alt: [
    '[K歌]', '[NO]', '[OK]', '[爱你]', '[爱情]', '[爱心]', '[傲慢]', '[白眼]', '[棒棒糖]', '[抱拳]', '[爆筋]', '[鄙视]', '[闭嘴]', '[鞭炮]', '[便便]', '[擦汗]', '[菜刀]', '[差劲]', '[钞票]', '[车头]',
    '[车尾]', '[车厢]', '[呲牙]', '[打哈欠]', '[大兵]', '[大哭]', '[蛋糕]', '[刀]', '[得意]', '[灯笼]', '[电灯泡]', '[凋谢]', '[发财]', '[发呆]', '[发抖]', '[发怒]', '[饭]', '[飞机]', '[飞吻]', '[奋斗]',
    '[风车]', '[尴尬]', '[勾引]', '[购物]', '[鼓掌]', '[害羞]', '[憨笑]', '[喝彩]', '[喝奶]', '[坏笑]', '[挥手]', '[回头]', '[饥饿]', '[激动]', '[街舞]', '[戒指]', '[惊恐]', '[惊讶]', '[咖啡]', '[磕头]',
    '[可爱]', '[可怜]', '[抠鼻]', '[骷髅]', '[酷]', '[快哭了]', '[困]', '[篮球]', '[冷汗]', '[礼物]', '[流汗]', '[流泪]', '[玫瑰]', '[面]', '[难过]', '[闹钟]', '[怄火]', '[啤酒]', '[瓢虫]', '[撇嘴]',
    '[乒乓]', '[祈祷]', '[气球]', '[汽车]', '[强]', '[敲打]', '[亲亲]', '[青蛙]', '[晴天]', '[糗大了]', '[拳头]', '[弱]', '[色]', '[沙发]', '[闪电]', '[胜利]', '[示爱]', '[手枪]', '[衰]', '[双喜]', '[睡]',
    '[太阳]', '[调皮]', '[跳绳]', '[跳跳]', '[偷笑]', '[吐]', '[微笑]', '[委屈]', '[握手]', '[西瓜]', '[下雨]', '[吓]', '[献吻]', '[香蕉]', '[象棋]', '[心碎]', '[信]', '[熊猫]', '[嘘...]', '[药]', '[疑问]',
    '[阴险]', '[拥抱]', '[右哼哼]', '[右太极]', '[雨伞]', '[月亮]', '[晕]', '[再见]', '[炸弹]', '[招财猫]', '[折磨]', '[纸巾]', '[咒骂]', '[猪头]', '[抓狂]', '[转圈]', '[足球]', '[左哼哼]', '[左太极]'
  ],
  faces: function () {
    const self = this
    const arr = {}
    for (let i = 0; i < self.alt.length; i++) {
      arr[self.alt[i]] = '/face/' + self.alt[i] + '.png'
    }
    return arr
  }
}

export function transform (content) {
  const fa = faceUtils.faces()
  if (content) {
    content = content
      // eslint-disable-next-line
      .replace(/face\[([^\s\[\]]+?)]/g, function (face) {
        // 转义表情
        const alt = face.replace(/^face/g, '')
        return '<img width="24px" height="24px" alt="' + fa[alt] + '" title="' + fa[alt] + '" src="' + fa[alt] + '">'
      })
  }
  return content
}
